> ExampleDNA1
; A dumb comment.
CGATTTCGCGTCCCCGAA

> ExampleDNA2 {"comments":[[2,5,"Haha another lame comment"]]}
CGGATTTACCC

> ExampleAmino1
mklpggdaaryy

> ExampleAmino2
#plkvvmasc
$mutate ExampleAmino1 3 v

> DerivedDNA1
$include ExampleDNA1
$include ExampleDNA2

> DerivedAmino1
$include ExampleAmino1
$include ExampleAmino2

> DerivedDNA2
# testlib defines importedDNA1 importedDNA2 importedDerivedDNA1
$include --lib testlib.fasta importedDNA1
$include DerivedDNA1

> ImportedAminos
$include --lib testlib.fasta importedPointlessAminos

> ImportedCrap
$include --lib testlib.fasta importedDerivedDNA1
$include --lib testlib.fasta importedDerivedDNA3
$dumb_backtranslate ImportedAminos
