> ExampleDNA1
; A dumb comment.
CGATTTCGCGTCCCCGAA

> ExampleDNA2 {"comments":[[2,5,"Haha another lame comment"]]}
CGGATTTACCC

> ExampleAmino1
mklpggdaaryy

> ExampleAmino2
#plkvvmasc
$mutate ExampleAmino1 3 v

> DerivedDNA1
$include ExampleDNA1
$include ExampleDNA2

> DerivedAmino1
$include ExampleAmino1
$include ExampleAmino2

> DerivedDNA2
# testlib defines importedDNA1 importedDNA2 importedDerivedDNA1
$include --lib testlib.fasta importedDNA1
$include DerivedDNA1

#> ImportedAminos
## Uses alternative shorthand import format.
#$include testlib.fasta.importedPointlessAminos

> ImportedCrap
$include --lib testlib.fasta importedDerivedDNA1
$include --lib testlib.fasta importedDerivedDNA3
$dumb_backtranslate testlib.fasta.importedPointlessAminos

# An anonymous block; no title means no FASTA object is
# registered after parsing this block, so macros can be
# freely called, and their return values will (barring
# the action of other macros) be discarded.
$include ExampleDNA2
{0}
{ExampleDNA1}
$def_template foo_template

> TemplateInject
CCCCCCCCCCCCCCCC

> LocalTemplateExample
$use_template foo_template TemplateInject

> RemoteTemplateExample
$use_template "testlib.fasta.Template 1" "testlib2.fasta.deepDNA3" "LocalTemplateExample"
