> ExampleDNA1
; A dumb comment.
CGATTTCGCGTCCCCGAA

> ExampleDNA2 {"comments":[[2,5,"Haha another lame comment"]]}
CGGATTTACCC

> ExampleAmino1
mklpggdaaryy

> ExampleAmino2
#plkvvmasc
$mutate ExampleAmino1 3 v

> DerivedDNA1
$include ExampleDNA1
$include ExampleDNA2

> DerivedAmino1
$include ExampleAmino1
$include ExampleAmino2

> DerivedDNA2
# testlib defines importedDNA1 importedDNA2 importedDerivedDNA1
$include --lib testlib.fasta importedDNA1
$include DerivedDNA1

> ImportedAminos
$include --lib testlib.fasta importedPointlessAminos

> ImportedCrap
$include --lib testlib.fasta importedDerivedDNA1
$include --lib testlib.fasta importedDerivedDNA3
$dumb_backtranslate ImportedAminos

# An anonymous block; no title means no FASTA object is
# registered after parsing this block, so macros can be
# freely called, and their return values will (barring
# the action of other macros) be discarded.
$include ImportedCrap
